app/controllers/admin/comandas_controller.rb

SELECT "comanda_items".* FROM "comanda_items" WHERE "comanda_items"."comanda_id" = $1  [["comanda_id", 2]]
---
  def index
    if session[:comanda_id]
      @comanda = ComandaItem.where comanda_id: session[:comanda_id]

SELECT  "products".* FROM "products" WHERE "products"."establishment_id" = $1 LIMIT $2 OFFSET $3  [["establishment_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."establishment_id" = $1  [["establishment_id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comanda_items" ("product_id", "comanda_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["comanda_id", 1], ["created_at", 2016-10-04 14:47:45 UTC], ["updated_at", 2016-10-04 14:47:45 UTC]]
INSERT INTO "comandas" ("establishment_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["establishment_id", 1], ["created_at", 2016-10-04 14:46:12 UTC], ["updated_at", 2016-10-04 14:46:12 UTC]]
---
  def create
       if params[:category].present? && params[:category] != "tudo"
      @products = Product.where(category_id: params[:category], establishment_id: params[:establishment_id]).page params[:page]
      @category = @products[0].category.name
    else
      @products = Product.where(establishment_id: params[:establishment_id]).page params[:page]
      @category = "Todos os pratos"
    end

    @categories = []
    @products.each do |p|

      @categories << p.category

    end

    @categories.uniq!

      product  = Product.find(params[:product_id])

        respond_to do |format|
      if @comanda_item = ComandaItem.create(product_id: params[:product_id], comanda_id: session[:comanda_id])

SELECT  "comandas".* FROM "comandas" WHERE "comandas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_session_comanda
      @comanda = Comanda.find(session[:comanda_id])