app/controllers/admin/establishments_controller.rb

  def index
    @establishments = Establishment.all.page params[:page]
---
SELECT  "establishments".* FROM "establishments" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "establishments"