app/controllers/admin/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."category_id" = $1 AND "products"."establishment_id" = $2 LIMIT $3 OFFSET $4  [["category_id", 1], ["establishment_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = $1 AND "products"."establishment_id" = $2  [["category_id", 1], ["establishment_id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."establishment_id" = $1 LIMIT $2 OFFSET $3  [["establishment_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."establishment_id" = $1  [["establishment_id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    if params[:category].present? && params[:category] != "tudo"
      @products = Product.where(category_id: params[:category], establishment_id: params[:establishment_id]).page params[:page]
      @category = @products[0].category.name
    else
      @products = Product.where(establishment_id: params[:establishment_id]).page params[:page]
      @category = "Todos os pratos"
    end

    @categories = []
    @products.each do |p|

INSERT INTO "products" ("image", "name", "description", "status", "category_id", "created_at", "updated_at", "establishment_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    @product.establishment_id = params[:establishment_id]
    respond_to do |format|
      if @product.save