app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		if @user = User.create(user_params)